In [1]:
#import libraries
import pandas as pd
import numpy as np
import os

# importing product data

In [2]:
path = r'/Users/spathak/Instacart_Basket_Analysis'

In [118]:
df_Prods= pd.read_csv(os.path.join(path,'02-Data','Original-Data','products.csv'),index_col = False)

# importing order data

In [133]:
df= pd.read_csv(os.path.join(path,'02-Data','Prepared Data','orders_wrangled.csv'),index_col = False)

In [134]:
df.head()

,Unnamed: 0,order_id,user_id,eval_set,order_number,orders_day_of_week,order_hour_of_day,days_since_prior_order
0,0,2539329,1,prior,1,2,8,NaN
1,1,2398795,1,prior,2,3,7,15.0
2,2,473747,1,prior,3,3,12,21.0
3,3,2254736,1,prior,4,4,7,29.0
4,4,431534,1,prior,5,4,15,28.0

# Mixed type data

In [136]:
df_test = pd.DataFrame()

In [137]:
df_test['mix'] = ['a', 'b', 1, True]

In [138]:
df_test.head()

    mix
0     a
1     b
2     1
3  True

In [139]:
for col in df_test.columns.tolist():
  weird = (df_test[[col]].applymap(type) != df_test[[col]].iloc[0].apply(type)).any(axis = 1)
  if len (df_test[weird]) > 0:
    print (col)

mix

In [140]:
df_test['mix'] = df_test['mix'].astype('str')

# Missing values

In [141]:
df_Prods.isnull().sum()

product_id        0
product_name     16
aisle_id          0
department_id     0
prices            0
dtype: int64

In [142]:
df_nan=df_Prods[df_Prods['product_name'].isnull()==True]

In [13]:
df_nan

       product_id product_name  aisle_id  department_id  prices
33             34          NaN       121             14    12.2
68             69          NaN        26              7    11.8
115           116          NaN        93              3    10.8
261           262          NaN       110             13    12.1
525           525          NaN       109             11     1.2
1511         1511          NaN        84             16    14.3
1780         1780          NaN       126             11    12.3
2240         2240          NaN        52              1    14.2
2586         2586          NaN       104             13    12.4
3159         3159          NaN       126             11    13.1
3230         3230          NaN       120             16    14.4
3736         3736          NaN        41              8    14.8
4283         4283          NaN        77              7    14.4
4790         4790          NaN        91             16    14.5
38187       38183          NaN        39             12    20.9
40444       40440          NaN       120             16    14.8

In [143]:
#  The shape function returns the number of rows and columns in a dataframe.
df_Prods.shape

(49693, 5)

In [144]:
# Create dataframe without missing values in 'product_name' column

df_Prods_clean = df_Prods[df_Prods['product_name'].isnull() == False]

In [145]:
# Compare row and column numbers for new dataframe
# Your new dataframe should have exactly 16 less rows than the original dataframe (the same as the number of missing values).

df_Prods_clean.shape

(49677, 5)

In [146]:
df_Prods.dropna(inplace = True)

In [147]:
df_Prods.dropna(subset = ['product_name'], inplace = True)

In [148]:
df_Prods_clean.shape

(49677, 5)

# Duplicates

In [149]:
df_dups = df_Prods_clean[df_Prods_clean.duplicated()]

In [150]:
df_dups

,product_id,product_name,aisle_id,department_id,prices
462,462,Fiber 4g Gummy Dietary Supplement,70,11,4.8
18459,18458,Ranger IPA,27,5,9.2
26810,26808,Black House Coffee Roasty Stout Beer,27,5,13.4
35309,35306,Gluten Free Organic Peanut Butter & Chocolate ...,121,14,6.8
35495,35491,Adore Forever Body Wash,127,11,9.9

In [151]:
df_Prods_clean.shape

(49677, 5)

In [152]:
df_Prods_clean_no_dups = df_Prods_clean.drop_duplicates()

In [153]:
df_Prods_clean_no_dups.shape

(49672, 5)

# Question 2,Describe function for order data

In [154]:
# Run the df.describe() function on your df_ords dataframe
# Tip: Keep an eye on min and max values!
df= pd.read_csv(os.path.join(path,'02-Data','Prepared Data','orders_wrangled.csv'),index_col = False)

In [155]:
df.describe()

,Unnamed: 0,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,days_since_prior_order
count,3.421083e+06,3.421083e+06,3.421083e+06,3.421083e+06,3.421083e+06,3.421083e+06,3.214874e+06
mean,1.710541e+06,1.710542e+06,1.029782e+05,1.715486e+01,2.776219e+00,1.345202e+01,1.111484e+01
std,9.875817e+05,9.875817e+05,5.953372e+04,1.773316e+01,2.046829e+00,4.226088e+00,9.206737e+00
min,0.000000e+00,1.000000e+00,1.000000e+00,1.000000e+00,0.000000e+00,0.000000e+00,0.000000e+00
25%,8.552705e+05,8.552715e+05,5.139400e+04,5.000000e+00,1.000000e+00,1.000000e+01,4.000000e+00
50%,1.710541e+06,1.710542e+06,1.026890e+05,1.100000e+01,3.000000e+00,1.300000e+01,7.000000e+00
75%,2.565812e+06,2.565812e+06,1.543850e+05,2.300000e+01,5.000000e+00,1.600000e+01,1.500000e+01
max,3.421082e+06,3.421083e+06,2.062090e+05,1.000000e+02,6.000000e+00,2.300000e+01,3.000000e+01

In [179]:
#Ran the frequency count  on  order hour of week..Data look fine it lie between 0-6. 
df.groupby('order_hour_of_day').count()

,Unnamed: 0,order_id,user_id,eval_set,order_number,orders_day_of_week,days_since_prior_order
order_hour_of_day,,,,,,,
0,21265,21265,21265,21265,21265,21265,21265
1,11636,11636,11636,11636,11636,11636,11636
2,7010,7010,7010,7010,7010,7010,7010
3,5117,5117,5117,5117,5117,5117,5117
4,5164,5164,5164,5164,5164,5164,5164
5,9023,9023,9023,9023,9023,9023,9023
6,28956,28956,28956,28956,28956,28956,28956
7,87227,87227,87227,87227,87227,87227,87227
8,168744,168744,168744,168744,168744,168744,168744
9,243452,243452,243452,243452,243452,243452,243452
10,271768,271768,271768,271768,271768,271768,271768
11,267812,267812,267812,267812,267812,267812,267812
12,255846,255846,255846,255846,255846,255846,255846
13,261087,261087,261087,261087,261087,261087,261087
14,266007,266007,266007,266007,266007,266007,266007
15,266375,266375,266375,266375,266375,266375,266375
16,255459,255459,255459,255459,255459,255459,255459
17,214208,214208,214208,214208,214208,214208,214208
18,171133,171133,171133,171133,171133,171133,171133
19,131383,131383,131383,131383,131383,131383,131383
20,97619,97619,97619,97619,97619,97619,97619
21,73471,73471,73471,73471,73471,73471,73471
22,57605,57605,57605,57605,57605,57605,57605
23,37507,37507,37507,37507,37507,37507,37507

In [181]:
# Ran the frequency count on orders day of week.Its looks fine data is lie between 0-23.
df.groupby('orders_day_of_week').count()

,Unnamed: 0,order_id,user_id,eval_set,order_number,order_hour_of_day,days_since_prior_order
orders_day_of_week,,,,,,,
0,562388,562388,562388,562388,562388,562388,562388
1,552505,552505,552505,552505,552505,552505,552505
2,439399,439399,439399,439399,439399,439399,439399
3,411314,411314,411314,411314,411314,411314,411314
4,401903,401903,401903,401903,401903,401903,401903
5,427295,427295,427295,427295,427295,427295,427295
6,420070,420070,420070,420070,420070,420070,420070

# Mixed Type data

In [157]:
# Check for mixed-type data in your df_ords dataframe.

for col in df.columns.tolist():
  weird = (df[[col]].applymap(type) != df[[col]].iloc[0].apply(type)).any(axis = 1)
  if len (df[weird]) > 0:
    print (col,)

In [158]:
df.dtypes

Unnamed: 0                  int64
order_id                    int64
user_id                     int64
eval_set                   object
order_number                int64
orders_day_of_week          int64
order_hour_of_day           int64
days_since_prior_order    float64
dtype: object

In [ ]:
# no mixed data found

# missing values in order data

In [159]:
# Run a check for missing values in your df_ords dataframe.
df.isnull().sum()

Unnamed: 0                     0
order_id                       0
user_id                        0
eval_set                       0
order_number                   0
orders_day_of_week             0
order_hour_of_day              0
days_since_prior_order    206209
dtype: int64

In [160]:
# Create subset for the missing values in df_ords
df_nan=df[df['days_since_prior_order'].isnull()==True]

In [161]:
df_nan

,Unnamed: 0,order_id,user_id,eval_set,order_number,orders_day_of_week,order_hour_of_day,days_since_prior_order
0,0,2539329,1,prior,1,2,8,NaN
11,11,2168274,2,prior,1,2,11,NaN
26,26,1374495,3,prior,1,1,14,NaN
39,39,3343014,4,prior,1,6,11,NaN
45,45,2717275,5,prior,1,3,12,NaN
...,...,...,...,...,...,...,...,...
3420930,3420930,969311,206205,prior,1,4,12,NaN
3420934,3420934,3189322,206206,prior,1,3,18,NaN
3421002,3421002,2166133,206207,prior,1,6,19,NaN
3421019,3421019,2227043,206208,prior,1,1,15,NaN
3421069,3421069,3154581,206209,prior,1,3,11,NaN

In [162]:
df.shape

(3421083, 8)

In [163]:

df_clean = df[df['days_since_prior_order'].isnull() == False]

In [164]:
df_clean.shape

(3214874, 8)

# Other method to solve Missing values

In [165]:
# Drop unnamed column for df_ords

df.dropna(inplace = True)

In [166]:
# Create subset for the missing values in df_ords
df.dropna(subset = ['days_since_prior_order'], inplace = True)

In [167]:
df_clean.shape

(3214874, 8)

# Duplicates in order data

In [168]:
df_dups = df_clean[df_clean.duplicated()]

In [169]:
df_dups
# no duplicate value found.

Empty DataFrame
Columns: [Unnamed: 0, order_id, user_id, eval_set, order_number, orders_day_of_week, order_hour_of_day, days_since_prior_order]
Index: []

In [170]:
df_clean.shape

(3214874, 8)

In [171]:
df_clean_no_dups = df_clean.drop_duplicates()

In [172]:
df_clean_no_dups.shape

(3214874, 8)

# Importing data in Prepared Data

In [173]:
df.to_csv(os.path.join(path,'02-Data','Prepared Data','orders_data_Consistency.csv'))

In [174]:
df_Prods.to_csv(os.path.join(path,'02-Data','Prepared Data','Products_data_Consistency.csv'))